<?php

namespace Faker\Provider\by_BY;

class Address extends \Faker\Provider\Address
{
    protected static $cityPrefix = ['горад'];
    protected static $regionSuffix = ['вобласць'];
    protected static $streetPrefix = [
        'вуліца', 'бульвар', 'завулак', 'плошча', 'праспект', 'праезд', 'тракт', 'тупік', 'набярэжная', 'спуск',
    ];
    protected static $buildingNumber = ['%#'];
    protected static $postcode = ['######'];
    protected static $country = [
        'Аб\'яднаныя Арабскія Эміраты',
        'Азербайджан',
        'Албанія',
        'Алжыр',
        'Аман',
        'Ангола',
        'Андора',
        'Антыгуа і Барбуда',
        'Аргенціна',
        'Арменія',
        'Аўстралія',
        'Аўстрыя',
        'Афганістан',
        'Багамы',
        'Балгарыя',
        'Балівія',
        'Бангладэш',
        'Барбадас',
        'Батсвана',
        'Бахрэйн',
        'Беларусь',
        'Беліз',
        'Бельгія',
        'Бенін',
        'Боснія і Герцагавіна',
        'Бразілія',
        'Бруней',
        'Буркіна-Фасо',
        'Бурундзі',
        'Бутан',
        'Вануату',
        'Венгрыя',
        'Венесуэла',
        'В\'етнам',
        'Вялікабрытанія',
        'Габон',
        'Гаіці',
        'Гамбія',
        'Гана',
        'Гандурас',
        'Гаяна',
        'Гватэмала',
        'Гвінея',
        'Гвінея-Бісау',
        'Германія',
        'Грузія',
        'Грэнада',
        'Грэцыя',
        'Дамініка',
        'Дамініканская Рэспубліка',
        'Данія',
        'Джыбуці',
        'Дэмакратычная Рэспубліка Конга',
        'Егіпет',
        'Емен',
        'Замбія',
        'Зімбабвэ',
        'Злучаныя Штаты Амерыкі',
        'Іарданія',
        'Ізраіль',
        'Інданезія',
        'Індыя',
        'Ірак',
        'Іран',
        'Ірландыя',
        'Ісландыя',
        'Іспанія',
        'Італія',
        'Каба-Вердэ',
        'Казахстан',
        'Калумбія',
        'Камбоджа',
        'Камерун',
        'Каморскія Астравы',
        'Канада',
        'Катар',
        'Кенія',
        'Кіпр',
        'Кірыбаці',
        'Кітай',
        'Коста-Рыка',
        'Кот-д\'Івуар',
        'Куба',
        'Кувейт',
        'Кыргызстан',
        'Лаос',
        'Латвія',
        'Лесота',
        'Ліберыя',
        'Ліван',
        'Лівія',
        'Літва',
        'Ліхтэнштэйн',
        'Люксембург',
        'Мадагаскар',
        'Мазамбік',
        'Малаві',
        'Малайзія',
        'Малдова',
        'Малі',
        'Мальдывы',
        'Мальта',
        'Манака',
        'Манголія',
        'Марока',
        'Маршалавы Астравы',
        'Маўрыкій',
        'Маўрытанія',
        'Мексіка',
        'М\'янма',
        'Намібія',
        'Нарвегія',
        'Науру',
        'Непал',
        'Нігер',
        'Нігерыя',
        'Нідэрланды',
        'Нікарагуа',
        'Новая Зеландыя',
        'Пакістан',
        'Палау',
        'Панама',
        'Папуа - Новая Гвінея',
        'Парагвай',
        'Партугалія',
        'Паўднёва-Афрыканская Рэспубліка',
        'Паўднёвая Карэя',
        'Паўднёвы Судан',
        'Паўночная Карэя',
        'Паўночная Македонія',
        'Перу',
        'Польшча',
        'Расія',
        'Руанда',
        'Румынія',
        'Рэспубліка Конга',
        'Саламонавы Астравы',
        'Сальвадор',
        'Самалі',
        'Самоа',
        'Сан-Марына',
        'Сан-Тамэ і Прынсіпі',
        'Саудаўская Аравія',
        'Сейшэльскія Астравы',
        'Сенегал',
        'Сент-Вінсент і Грэнадзіны',
        'Сент-Кітс і Невіс',
        'Сент-Люсія',
        'Сербія',
        'Сінгапур',
        'Сірыя',
        'Славакія',
        'Славенія',
        'Судан',
        'Сурынам',
        'Сьера-Леонэ',
        'Таджыкістан',
        'Тайланд',
        'Танзанія',
        'Тога',
        'Тонга',
        'Трынідад і Табага',
        'Тувалу',
        'Туніс',
        'Туркменістан',
        'Турцыя',
        'Уганда',
        'Узбекістан',
        'Украіна',
        'Уругвай',
        'Усходні Тымор',
        'Федэратыўныя Штаты Мікранезіі',
        'Фіджы',
        'Філіпіны',
        'Фінляндыя',
        'Францыя',
        'Харватыя',
        'Цэнтральна-Афрыканская Рэспубліка',
        'Чад',
        'Чарнагорыя',
        'Чылі',
        'Чэхія',
        'Швейцарыя',
        'Швецыя',
        'Шры-Ланка',
        'Эквадор',
        'Экватарыяльная Гвінея',
        'Эрытрэя',
        'Эсваціні',
        'Эстонія',
        'Эфіопія',
        'Ямайка',
        'Японія',
    ];

    protected static $region = [
        'Брасцкая',
        'Віцебская',
        'Гомельская',
        'Гродненская',
        'Магілеўская',
        'Мінская',
    ];

    protected static $city = [
        'Асіповічы',
        'Астравец',
        'Барысаў',
        'Брэст',
        'Буда-кашалева',
        'Ваўкавыск',
        'Віцебск',
        'Гомель',
        'Гродна',
        'Дзяржынск',
        'Ельск',
        'Жодзіна',
        'Заслаўе',
        'Іўе',
        'Кобрын',
        'Ліда',
        'Лепель',
        'Лунінец',
        'Магілеў',
        'Мазыр',
        'Мар\'іна горка',
        'Мінск',
        'Нясвіж',
        'Орша',
        'Пінск',
        'Ракаў',
        'Рэчыца',
        'Слуцк',
        'Тураў',
        'Ушачы',
        'Фаніпаль',
        'Хойнікі',
        'Целяханы',
        'Чашнікі',
        'Шчучын',
        'Шклоў',
        'Ярэмічы',
    ];

    /**
     * @see Part of the list from https://be.wikipedia.org/wiki/%D0%A1%D0%BF%D1%96%D1%81_%D0%B2%D1%83%D0%BB%D1%96%D1%86_%D0%9C%D1%96%D0%BD%D1%81%D0%BA%D0%B0
     */
    protected static $street = [
        'Аранская',
        'Берасцейская',
        'Вясёлкавая',
        'Голубева',
        'Дамброўка',
        'Еўфрасінні Полацкай',
        'Жудро',
        'Залатая горка',
        'Ігната Дамейкі',
        'Каліноўскага',
        'Леаніда Бяды',
        'Лесі Украінки',
        'Максіма Багдановіча',
        'Нававіленская',
        'Олешава',
        'Петруся Броўкі',
        'Раманаўская Слабада',
        'Сурганава',
        'Тараса Шаўчэнкі',
        'Усіхсвяцкая',
        'Францыска Скарыны',
        'Харкаўская',
        'Ціміразева',
        'Чалюскінцаў',
        'Шабаны',
        'Экскаватарная',
        'Юнацкая',
        'Янкі Купалы',
        'Янкі Маўра',
        'Якуба Коласа',
        'Ярашэвіцкая',
    ];

    protected static $addressFormats = [
        '{{postcode}}, {{cityAndRegion}}, {{streetPrefix}} {{streetName}}, {{buildingNumber}}',
    ];

    protected static $streetAddressFormats = [
        '{{streetPrefix}} {{streetName}}, {{buildingNumber}}',
    ];

    public static function citySuffix()
    {
        // We don't use city suffix
        return '';
    }

    public static function streetSuffix()
    {
        // We don't use street suffix
        return '';
    }

    public function streetName()
    {
        return static::randomElement(static::$street);
    }

    public static function postcode()
    {
        return static::toUpper(static::bothify(static::randomElement(static::$postcode)));
    }

    public static function regionSuffix()
    {
        return static::randomElement(static::$regionSuffix);
    }

    public static function region()
    {
        return static::randomElement(static::$region);
    }

    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    public function city()
    {
        return static::randomElement(static::$city);
    }

    /**
     * Get city and region together
     * We need it because city and region must comply each other in Belarus
     *
     * @example 'Мінская вобласць, горад Слуцк'
     *
     * @return string
     */
    public function cityAndRegion()
    {
        $regionAndCityNumber = self::numberBetween(0, count(static::$region) - 1);
        $region = static::$region[$regionAndCityNumber];
        $city = static::$city[$regionAndCityNumber];
        $format = "$region {{regionSuffix}}, {{cityPrefix}} $city";

        return $this->generator->parse($format);
    }

    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }
}
