<?php

namespace Faker\Provider\by_BY;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = [
        'чорны', 'цёмна-бардовы', 'зялёны', 'цёмна-сіні', 'аліўкавы',
        'фіялетавы', 'ружовы', 'сіні', 'чырвоны',
        'шэры', 'жоўты', 'блакітны', 'белы',
    ];

    /**
     * @see Part of the list from https://be.wikipedia.org/wiki/%D0%A1%D0%BF%D1%96%D1%81_%D0%BA%D0%BE%D0%BB%D0%B5%D1%80%D0%B0%D1%9E
     */
    protected static $allColorNames = [
        'Алізарынавы чырвоны', 'Бурштынавы', 'Аметыставы', 'Cпаржа', 'Колер марской хвалі', 'Аквамарынавы',
        'Блакітны', 'Бэж', 'Бістр', 'Чорны', 'Сіні', 'Вада пляжу Бондзі',
        'Латуневы', 'Светла-зялёны', 'Светла-бірузовы', 'Бронзавы', 'Скура тура', 'Бургундыя',
        'Умбра смаленая', 'Руды', 'Малінавы', 'Баваўняны', 'Баклажанавы', 'Фуксія',
        'Залаты', 'Шэры', 'Зялёны шэры гарбата', 'Геліятроп', 'Індыга', 'Міжнародны, сігнальны Аранжавы',
    ];
}
