<?php

namespace Faker\Provider\uk_UA;

class Company extends \Faker\Provider\Company
{
    protected static $formats = [
        '{{companyName}}',                                       // Лідскае піва
        '{{companyPrefix}} "{{companyName}}"',                   // ААТ "Лідскае піва"
        '{{companyName}}-{{companySuffix}}',                     // СтэкЛэвэл-Груп
        '{{companyPrefix}} "{{companyName}}-{{companySuffix}}"', // АТУП "Віп-турс"
    ];

    protected static $urlFormats = [
        '{{companyName}}',
        '{{companyName}}-{{companySuffix}}',
    ];

    protected static $companyPrefix = ['ААТ', 'АТУП', 'ЗАТ', 'УЗ', 'УА', 'КААП'];
    protected static $companySuffix = ['Сервіс', 'Плюс', 'Груп', 'Турс'];

    protected static $companyName = [
        'Лідскае піва', 'Аліварыя', 'Віп-турс', 'Альфа банк', 'Планета здароўя', 'Універсал',
        'БДУІР', 'БДУ', 'БНТУ', 'Беларусбанк', 'А-100', 'Нафтан', 'Спартак',
        'Марк Фармэль', 'Світанак', 'Мілавіца', 'Камунарка', 'Вітэкс', 'Інтэграл',
    ];

    protected static $jobTitleFormat = [
        'Аграном', 'Адвакат', 'Актор', 'Акушэр', 'Антраполаг', 'Аптэкар', 'Архітэктар', 'Астранаўт', 'Астрафізік', 'Аўтаслесар', 'Агент',
        'Акуліст', 'Анколаг', 'Аператар', 'Арганізатар', 'Апякун', 'Ахоўнік',
        'Барыста', 'Бармэн', 'Біёлаг', 'Батанік', 'Бондар', 'Будаўнік', 'Бухгалтар', 'Бібліятэкар',
        'Вядучы', 'Ветэрынар', 'Візажыст', 'Выкладчык',
        'Географ', 'Геолаг', 'Геафізік', 'Гінеколаг', 'Горны інжынер', 'Графік', 'Грамадскі дзеяч', 'Гісторык',
        'Дантыст', 'Дзяржаўны супрацоўнік', 'Дэтэктыў', 'Дызайнер', 'Дыпламат', 'Дацэнт', 'Драматург',
        'Эканаміст', 'Электраманцёр', 'Электрык', 'Эпідэміёлаг', 'Этнограф', 'Эколаг',
        'Журналіст', 'Жывапісец',
        'Заолаг',
        'Інжынер камп’ютарнай тэхнікі', 'Інжынер', 'Іканапісец', 'Інспектар', 'Інструктар',
        'Каскадзёр', 'Кіроўца', 'Клавішнік', 'Клоўн', 'Кампазітар', 'Кансьерж', 'Канструктар', 'Краязнаўца', 'Крыміналіст', 'Кінаактор', 'Кінакрытык', 'Кінарэжысёр', 'Кур’ер', 'Кінолаг', 'Круп’е',
        'Лабарант', 'Лётчык', 'Лекар', 'Ляснічы', 'Літаратуравед', 'Лор',
        'Мастак', 'Матэматык', 'Майнер', 'Машыніст', 'Медык', 'Менеджэр', 'Мілер', 'Мікрабіёлаг', 'Мінералаг', 'Мовазнаўца', 'Музыка', 'Маркетолаг', 'Мяснік',
        'Настаўнік', 'Навукоўца', 'Няня', 'Натарыус', 'Наводчык-аператар',
        'Палеантолаг', 'Парфумер', 'Пчаляр', 'Патологоанатом', 'Педагог', 'Пекар', 'Перекладач', 'Перукар', 'Петрограф', 'Письменник', 'Піаніст', 'Підприємець', 'Пілот', 'Правник', 'Прибиральник', 'Програміст', 'Провізор', 'Прокурор', 'Промисловець', 'Професор', 'Психолог', 'Політик', 'Публіцист', 'Продюсер',
        'Рэжысёр', 'Рэабілітолаг', 'Рэдактар', 'Рэстаўратар', 'Рыэлтар',
        'Сантэхнік', 'Святар', 'Скульптар', 'Сацыёлаг', 'Спявачка', 'Спартсмен', 'Сцэнарыст', 'Стрынгер', 'Стаматолаг', 'Следчы', 'Стыліст', 'Сакратар', 'Стрэлачнік', 'Сцюардэса', 'Суддзя',
        'Таксіст', 'Тамада', 'Танцорка', 'Тэнісіст', 'Тэрапеўт', 'Ткач', 'Тэрнер', 'Тынкоўшчык', 'Трактарыст', 'Трэнер', 'Тэстар',
        'Фармацэўт', 'Фермер', 'Фізік', 'Філолаг', 'Фалькларыст', 'Фармоўшчык', 'Фатограф', 'Футбаліст', 'Фларыст', 'Фінансіст',
        'Хірург', 'Хімік', 'Харэограф',
        'Шэрыф', 'Швачка',
        'Ювелір', 'Юрыст',
    ];

    public function companyUrl()
    {
        $format = static::randomElement(static::$urlFormats);

        return $this->generator->parse($format);
    }

    public static function companyPrefix()
    {
        return static::randomElement(static::$companyPrefix);
    }

    public static function companyName()
    {
        return static::randomElement(static::$companyName);
    }
}
