<?php

namespace Faker\Provider\by_BY;

class Text extends \Faker\Provider\Text
{
    /**
     * From https://knihi.com
     *
     * Тэксты узяты з афіцыйнага сайта "Беларускай палічкі"
     * і даступныя на умовах ліцэнзіі Creative Commons Attribution/Share-Alike
     *
     *
     * Title: Людзі на балоце
     *
     * Author: Іван Мележ
     *
     * Release Date: 1961
     *
     * Language: Belarusian
     *
     * @see https://knihi.com/Ivan_Mielez/Ludzi_na_balocie.html
     * @see https://be.wikipedia.org/wiki/%D0%9B%D1%8E%D0%B4%D0%B7%D1%96_%D0%BD%D0%B0_%D0%B1%D0%B0%D0%BB%D0%BE%D1%86%D0%B5_(%D1%80%D0%B0%D0%BC%D0%B0%D0%BD)
     *
     * @var string
     */
    protected static $baseText = <<<'EOT'

I

Хаты былі на востраве. Востраў гэты, праўда, не кожны прызнаў бы за востраў - аб яго не плёскаліся ні марскія, ні нават азёрныя хвалі. Навокал адно гніла куп'істая дрыгва ды моклі панурыя лясы.

Вёска тулілася ля берага вострава - платы агародаў дзе-нідзе забягалі на куп'ё ўзболатка. З другога боку, на поўнач, балоты крыху адступалі, дорачы людзям пясчанае поле. Адступалі балоты і на заходнім баку, дзе рунелі ці жаўцелі да краю лесу палі, таксама скупыя, няўдзячныя, хоць у іх глебе і было менш пяску. З поўдня балоты зноў падбіраліся да саламяных, замшэлых радоў стрэх, але ў гэты бок ішла найбольш сувязь са светам, і тут па дрыгве была намошчана дарожка. Што гэта за дарожка, можна меркаваць хоць бы з таго, што ездзілі па ёй смела толькі ў маразы, калі і непралазная твань навокал рабілася цвёрдая, як ток, ці ўлетку, калі дарожка перасыхала.

Большую частку года востраў быў як бы адасоблены ад іншых вёсак і мястэчак. Нават у непаганыя дні рэдкія газеты ці лісты ад сыноў і братоў дабіраліся сюды ў паляшуцкай торбе нялёгка - каму было прыемна лазіць па гразі без вельмі важнай прычыны, - але і гэтая нямоцная сувязь са светам пры кожным зацяжным дажджы лёгка рвалася. Восенню ці вясной яна перарывалася на цэлыя месяцы: багна, што страшна разбухала ад слоты і разводдзя, адразала востраў ад свету мацней, чым гэта маглі б зрабіць абшары вадзянога прастору. Многія дні людзі жылі, як на плыце, які злая нягода адарвала ад берага і занесла ў мора, - трэба чакаць адно, калі спадарожны вецер ці лёс зноў падгоніць да зямлі.

Але такое становішча тут не палохала, людзям на востраве яно здавалася зусім звычайным. З усіх бакоў, блізка і далёка, ведалі яны, - такія ж самыя выспы сярод бясконцых багнаў, дзікіх зараснікаў, што разлегліся на сотні вёрст з поўначы на поўдзень і з захаду на ўсход. Людзям тут трэба было жыць, і яны жылі. Аднастайныя, нудныя дажджы, што месяцамі лілі на мокрыя стрэхі, сцюдзёныя вятры, што люта білі ў замерзлыя вочкі-шыбы завеямі, цёплае сонца, што ўставала ў пагодныя дні над купамі алешніку, - усё бачыла гэты востраў заклапочаным, у няспыннай, штодзённай руплівасці. Людзі заўсёды чым-небудзь былі заняты: уранку і ўвечары, летам і зімою, у хаце, на двары, у полі, на балоце, у лесе...

Жылі ўжо Курані і ў гэту чэрвеньскую рань. Калі сонца выпырснула першыя праменні між вяршынь Церамоскага лесу, з каміноў на куранёўскіх стрэхах віліся ціхія ранішнія дымочкі, у расчыненых хлявах там і тут чулася цырканне малака ў даёнкі, лагодныя і строгія покрыкі жанчын. У некалькіх дварах гукі гэтыя перабіваў чысты, працавіты клёкат жалеза аб жалеза - касцы ладзілі, адбівалі малаткамі косы, рыхтаваліся ісці на балота. На пустой вуліцы, з торбай цераз плячо, ніжучы босымі нагамі цёмны след на падбеленай расой траве, ішоў, размахваў доўгай вераўчанай пугай яшчэ санлівы хлопец-пастух. Ён час ад часу звонка ляскаў пугай і аднастайна, хрыпата пакрыкваў:

- Ка-ро-вы!.. Ка-ро-вы!.. Ка-ро-вы!..

Голас яго пасля сну быў нямоцны, высільвацца яму не хацелася, і ён як бы памагаў сабе лянівым, але звонкім ляскам пугі. Вароты на вуліцу хутка расчыняліся, каровы павольна, са шляхецкай паважнасцю сыходзіліся ў статак, які багацеў рыкам, пярэсціўся, шырэў на ўсю вуліцу. Калі ён дайшоў да краю сяла, з апошняга двара высунулася рудая, з белай лысінкай карова, якую падганяла чарнявая дзяўчына з дубцом. Далучыўшы карову да статка, дзяўчына з дубцом подбегам вярнулася ў хату, але не выпаўз яшчэ статак з вуліцы, як яна ўжо з драўляным вядром у руцэ паявілася зноў на двары. Яна падышла да зруба калодзежа, які другім бокам выходзіў на суседні двор, бразнула, начапіла дужку вядра на крук вочапа. Журавель варухнуўся, падаўся вочапам да вады, задаволена, радасна зарыпеў.

Набраўшы вады, дзяўчына ўжо звыкла намерылася пацягнуць вочап і раптам адумалася, аслабіла рукі. Нахіліўшыся больш над калодзежам, прытрымліваючы рукой вочап, каб не вагаўся, стала глядзець уніз, чакаць, калі вада супакоіцца. Яна хацела, мусіць, паглядзецца ў ваду, але з хаты раптам пачуўся нездаволены крык:

- Ганно-о! Дзе ты, нячыстая сіла?!.

- Я - зараз!.. Нясу ўжэ!..

Дзяўчына заспяшалася, хутчэй зняла вядро з вочапа і, разліваючы на пясок ваду, падалася к хаце...

На суседнім двары, каля хлява, завіхаўся пры калёсах барадаты, у палатнянай доўгай сарочцы дзядзька - квачом з дзёгцем, што маслена пабліскваў ад сонца, мазаў восі. Поблізу яго, прывязаны да плота, стаяў нязграбны галавасты конь, ляніва штосьці шукаў у траве... У двары, што быў за гэтым, жанчына несла зелле свінні і падсвінку, якія рохкалі і вішчалі так прагна, што віск іх на час заглушыў усе іншыя гукі куранёўскай раніцы.

- Ціхо! Няма на вас угамону! - крыкнула на іх жанчына, падаючы спажыву, на якую свінні адразу накінуліся, душачыся, адпіхваючы адно аднаго і кусаючыся. Асабліва лютавала худая свіння, і жанчына пашукала вачыма дручка, каб супакоіць яе, адагнаць ад падсвінка. Але дручка не было, і яна злосна таўханула свінню парэпанай нагой, прыгразіла:

- Вось я зараз цябе!..

З кожнай хвілінай Курані ўсё больш поўніліся людскімі галасамі, людскім рухам - на адным двары маці клікала сына, на другім плакала, залівалася слязьмі не ў час разбуджанае дзіця. У двор каля ліпы пажылы чалавек уводзіў з пашы каня, з двара насупроць выганялі парасят, і ішло за імі пакорлівае мурзатае дзіця, як старое, угінаючы плечы...

У такі час з хаты, недалёка ад той, дзе дзяўчына брала ваду, выйшаў на ганак, пацягваючыся, хлопец з хмурнымі заспанымі вачыма, з калматай не то русявай, не то цёмнай чупрынай, з упартымі губамі.

Маці пашкадавала будзіць яго раней. Але і цяпер прачынацца яму было нялёгка - калі яна будзіла, у галаве некаторы час мяшаліся і малюнкі перарваных дзіўных відовішчаў, і словы маці, і назойлівы бусліны клёкат... Жмурачыся ад сонца, на ганку Васіль успомніў пра гэты клёкат, паслухаў - хтосьці блізка адбіваў касу - клё, клё, клё. У галаве варухнулася абыякавая думка, што гэта і быў той клёкат, які ў дрымоце здаўся за бусліны.

За гэтым на памяць прыйшлі яму словы, якімі маці будзіла: «Устань, сынок... Устань, бо ўсе ўсталі... Позно будзе...» Ён зірнуў на сонца - дзе яно, нізка ці высока - і на момант аслеп ад яго бляску. Ён, было добра прыкметна, адразу як бы ажыў, занепакоіўся - сонца ззяла, яму здалося, высока.

«Не разбудзіла па-людску! Калі ўсе ўставалі! - падумаў нездаволена, нават узлавана пра маці і тут жа заклапочана падаўся з ганка. - Каня трэ хутчэй прывесці!.. А то выберашся пазней за ўсіх цераз ету матку!.. Сорам будзе!..»

Ён подбегам падаўся да ўзболатка, дзе пасціўся перад алешнікам спутаны конь. Калі ён уехаў зноў на двор, убачыў сутулаватага, з жоўтай лысінай дзеда Дзяніса, які корпаўся пры калёсах. Дзед колькі дзён таму, ловячы рыбу, вымак і прастудзіўся - учора пластам ляжаў на печы, а сёння - нб табе, таксама падняўся.

- Мо паправіліся ўжэ? - кінуў Васіль, саскочыўшы з каня.

- Эге, паправіўся! - панура пакруціў галавой дзед. - Тым часам, як дзіця, якое першы раз устало...

- Дак леглі б пайшлі.

- Улежыш тут! У етакі дзень! - Дзед правёў худой рукой пад пузам каня. - Наеўся непагано!

- Наеўся.

Васіль прывязаў каня да падмазаных яшчэ ўчора звечара калёс і ўвайшоў у хату; маці стаяла пры печы, варушыла ў ёй качаргою. Пачуўшы сына, не азіраючыся, стала завіхацца хутчэй, і Васілю ад гэтага маўклівага знаку матчынай увагі і пашаны да яго стала весялей. Ён, аднак, не паказаў, што заўважыў гэта, - чаму тут здзіўляцца, калі ён ужо не хлапчук які, а гаспадар, - кінуў ёй дзелавіта:

- Збірайся... Чарнушкі ўжэ едуць...

Ён вярнуўся ў каморку, зняў адбітую дзедам касу, паспрабаваў, як вучыў Чарнушка, ногцем вастрыё - хоць гэта ён ужо рабіў учора некалькі разоў, - выцягнуў з-пад палацяў лапці і стаў абувацца. Валодзька, малы бялявы брат, што спаў на палацях, раптам заварушыўся, расплюшчыў вочы, зірнуў на Васіля і мігам ускочыў.

- Вась, а Вась, - і я?!

Васіль прамовіў:

- Ляжы ты, нуда! Чаго ўспёрся ні свет ні зара!

- Вась, вазьмі мяне... з сабою!..

- Трэба ты мне!

- Ну, вазьмі-і!

Дарэмна Валодзька чакаў адказу, пазіраючы на брата вачыма, якія прасілі і малілі, ніяк не хочучы верыць у братнюю чэрствасць. Васіль маўчаў. Ён быў непахісны. Абуўшыся, Васіль заклапочана пашаргаў у хату, па-ранейшаму нібы не заўважаючы брата, што, як прывязаны, патупаў услед.

Калі маці падала на стол аладкі і нават - дзіва! - скавародку з салам, Валодзька амаль не аддаў гэтаму ўвагі, па-ранейшаму чакаў.

- Ну, Вась?

- Дай, тым часам, паесці чалавеку, - сказаў дзед, які ўжо гарбата сядзеў каля стала, нічога не браў у рот. - І сам еш.

- Глядзі от, - ласкава прыступілася маці.

Яна знарок паклала перад Валодзькам аладку і кавалачак рудога сала, зірнуўшы на якое, Валодзька не ўтрываў і на час адстаў ад брата. Маці падала яму яшчэ кавалачак, дадала некалькі ласкавых слоў, і сэрца малога палагоднела ад гэтай дабраты. Але неўзабаве яму давялося адчуць, што гэтая матчына дабрата была ўсяго-наўсяго хітрасцю, бо ледзь толькі Валодзька пад'еў, маці мякка, ласкава сказала:

- Ты, сыночак, будзеш з дзедам, хату пасцеражэш. Ды глядзі добранько - усё дабро тут на вашых руках!.. Не дай Бог што-небудзь учыніцца - згалеем зусім!

- Я на балото хачу! - заявіў упарта малы.

Выціраючы аладкай скавародку, Васіль жорстка кінуў:

- Мало што ты хочаш!

З якой зайздрасцю і непакоем пазіралі Валодзькавы вочы, як каля хлява запрагаў старэйшы брат рудога Гуза, пагрозна пакрыкваючы, як дзед укладваў касу, як маці прывязвала торбу з харчамі і абгортвала ўкінутай у воз травою дубовую біклажку з вадой. Сачыў малы то за маці і дзедам, то за братам, нахмурыўшы шаўкавістыя, выцвілыя на сонцы броўкі, ніяк не мог паверыць у чалавечую бессардэчнасць, чакаў з тайнай надзеяй жаданай перамены.

Васіль тузануў вераўчанымі лейцамі Гуза, і калёсы паволі пакаціліся па двары на вуліцу. Тут Васіль азірнуўся - на ўсёй вёсцы, амаль каля кожнай хаты, стаялі калёсы, касцы, жанчыны і дзеці. На ўсёй вуліцы было на рэдкасць людна, яна ўся жыла добрай чалавечай заклапочанасцю.

Маці чамусьці яшчэ раз забегла ў хату, потым сказала дзеду, каб ён не высільваўся, пайшоў лёг, стала наказваць Валодзьку, што яму трэба і чаго няможна рабіць: каб быў пры хаце, каб слухаўся дзеда, каб не дурэў з агнём, - і Валодзька адчуў, што апошнія яго надзеі прападаюць.

- Не хачу! - адказаў адным словам Валодзька.

- А етаго во - хочаш? - памахаў яму пугай брат.

Валодзька толькі яшчэ больш нахмурыў бровы. Маці ж усё не траціла надзеі дамовіцца па-добраму:

- Я табе кулеш у чыгунку ў печцы паставіла. Смачны, з малаком... А ў прыпечку яечко вазьмі!.. Можаш узяць!

- Едзьце бо! - сказаў дзед. - Угаворваюць, ей-бо, як пісара валасного!..

Маці падабрала даматканую сваю спадніцу і звычна села на калёсы, спусціўшы з драбінак босыя парэпаныя ногі.

- Дак глядзі ж, кеб пільнаваў добра! Бо ўвечар я прыеду!

Валодзька, здаецца, нічога не хацеў слухацца: ні матчыных добрых слоў, ні дзедавай строгасці, ні братавай пагрозы пугай.

Ледзь калёсы рушылі па вуліцы, ён, набычыўшыся, падтрымліваючы рукой штонікі, што спадалі, маўкліва падаўся ўслед.

- Вярніся, неслух! - пачуў ён дзедаў загад, але і не падумаў спыніцца.

Валодзя ведаў, што дзед не любіў неслухмянасці і што маці таксама не дай Бог увесці ў гнеў, але яму так хацелася ехаць на балота, што і страх не ўтрымліваў, - Валодзька адно для бяспекі трымаўся наводдаль ад воза. Калі калёсы прыпыніліся і брат паказаў, што збіраецца саскочыць, малы адразу стаў таксама, гатовы да ўсяго. Васіль пагразіўся:

- Толькі пайдзі ўслед!

Калёсы спыняліся яшчэ разы тры, і кожны раз то маці, то брат загадвалі вярнуцца, не на жарт абяцалі набіць, і, можа, Валодзька адолеў бы сваё вялікае хаценне, калі б не ўбачыў, што на другім возе, які выехаў услед з сяла, сядзіць разам з бацькам яго найбліжэйшы прыяцель, супольнік ва ўсіх шкодах, Хведзька. Гэта надало Валодзьку порсткасці, і ён яшчэ смялей кінуўся за калёсамі.

- А-а, - закрычаў, душачыся слязьмі, ён, - вазьміце!

Маці злезла з калёс.

- Вярніся! Ідзі дамоў, чуеш!

- Не пайду!

- Не пойдзеш?

Праз некалькі хвілін ён ляжаў на мяккай раллі між кусцікаў бульбы блізка ад дарогі, і ўзлаваная маці моцна і гучна пляскала яго па голых паружавелых палавінках.

- Вернешся?.. Вернешся?.. Вернешся?..

Валодзька, рыючы лбом пульхную зямлю, выў і роў ад болю, ад крыўды, ад злосці, але не гаварыў нічога.

Маці пайшла ад яго, так і не дачакаўшыся хоць слова.

Седзячы ў бульбоўніку, ён цераз завалоку слёз зверавата пазіраў, як яна ішла да воза, як села і паехала, грозна глянуўшы на яго. «Кеб ты... кеб табе... немач!» - кіпела ў ім няўтольная злосць.

Паўз малога па дарозе ехалі і ішлі мужыкі, і амаль кожны падсмейваўся з яго бяды: «Што, усыпалі?» Гэта распальвала яго крыўду. Невясёлы, адзінокі і, як мала хто ў свеце, няшчасны, пацёгся ён дамоў, пацёгся цераз бульбоўнік, цераз агароды, толькі б нікога не сустракаць, нікога не бачыць!..

Калёсы, на якіх сядзелі Васіль і маці, ужо ўязджалі ў лес. Пасля поля тут было ад гушчыні маўклівых, нібы прытоеных, хмурных хваін цемнавата і сыра, хоць лясок і рос на пясчаніку. Ранішняе сонца, што чырвоніла хвойнік угары, яшчэ не магло прабіцца да нізу, да зямлі, і на рэдкай траве тут мутна трымалася раса, а на пяску значыліся вільготныя цемнаватыя плямы. Не зважаючы на расу і сырасць, адчувалася ўжо набліжэнне дзённай задухі.

- Душно будзе, - сказала маці.

Неўзабаве яны дагналі Чарнушкаў. Можна было б ехаць за імі, аддаючы знак пашаны дзядзьку Цімоху, як старэйшаму, і, можа, у іншых абставінах Васіль так і зрабіў бы, але побач з дзядзькам сядзела задзіра Гануля, яго дачка, Васілёва равесніца. Гэтая задзіра ў апошні час Васілю проста жыць не давала, пры кожнай сустрэчы, калі б ні трапіўся ён - смяялася ці нават здзекавалася з яго. От жа толькі пазаўчора пры ўсіх абсмяяла. «Васіль, а чаму ето ў цябе вочы не адзінакія - адно, як вада, светлае, а другое - як жалудок! І валасы унь - ззаду як не чорныя, а спераду - рудзенькія! Як у цяляці рабого». Стаяла і рагатала пры ўсіх! Каб не праўду казала, яшчэ б нішто, а то ж праўда ўсё - розныя вочы, як на грэх, і валасы ад сонца наперадзе зарудзеліся! Усё нялюдскае нейкае!..

Ці ж мог пасля ўсяго гэтага Васіль паслухмяна цягнуцца за Чарнушкамі? Ледзь маці ўправілася сказаць дзядзьку Цімоху, што, мусіць, будзе задуха, як Васіль, тузануўшы Гуза лейцамі, чапляючы калёсамі за нізкае галлё падлеску, порстка аб'ехаў Чарнушкаў, пакінуў ззаду. Ён знарок не паглядзеў на Ганну, але і не пазіраючы на яе, Васіль адчуваў сябе ў поўнай меры шчаслівым. Вось як ён «абступіў» яе, задзіру.

Хто яна, гэта ганарліўка, якая так абыходзіцца, нібы яна не толькі нараўне з ім, а Бог ведае што. Каб яна была і праўда кім-небудзь асаблівым, тады б і трываць можна было б, а то ж хто - усяго бацькава дачка. І гэтак абыходзіцца з ім, з чалавекам самастойным, гаспадаром! Што ж, ён паказаў ёй!..

Тут, калі Васіль быў увесь напоўнен слодыччу адплаты, стары, вельмі пацёрты хамут раптам разышоўся, і аглобля зашоргала па рудых Гузавых нагах. Васіль трывожна саскочыў. Нічога страшнага не было: проста парвалася супоня.

Васіль хутчэй звязаў парваныя канцы, але калі паспрабаваў, пацягнуўшы з усяе сілы, ці моцна завязаны вузялок, той разышоўся. Прыйшлося зноў звязваць. Калі, паружавеўшы ад натугі, сцягваў супоню на хамуце, побач зарыпелі калёсы дзядзькі Цімоха.

- Што такое?

- Супоня... з-зараза...

Гануля весела зіркнула.

- Ён... супоню дома забуў!

Васіль ад такой абразы аж перастаў сцягваць хамут. Калёсы дзядзькі Цімоха, а на іх дзядзька, Хведзька і здаволеная Гануля, прайшлі паўз Васіля і сталі пакрыху аддаляцца.

- Ну, ты знаеш!..

Васіль не ведаў, што сказаць.

- У чужое просо не ўтыкай носа!..

Ён прамовіў гэтыя словы ціха, больш для маці ды для сябе, каб супакоіцца. І наогул, хіба добра было б яму, няхай і маладому чалавеку, але ж мужчыну і гаспадару, старшаму ў сям'і, звязвацца з нейкай дзяўчушкай? Але ні словы, ні думкі гэтыя не вярталі яму спакою і раўнавагі.

Васіль ехаў цяпер пануры, паглыблены ў свае думкі. Ён наогул быў схільны да развагі, не любіў вельмі адкрываць сваю душу, асабліва калі ў ёй варушыліся думкі, невясёлыя і нядобрыя. Пахістваючыся, крыху горбячыся, хмурачы яшчэ дзіцячы лоб, ён міжвольна прыгадваў, дзе і калі яна казала што-небудзь крыўднае, думаў, як аддзячыць ёй. У думкі гэтыя хутка ўпляліся іншыя - спачатку пра старую, патлелую ў зямлі супоню, стары хамут, потым пра небараку Гуза, якога калісьці кінулі балахоўцы, не маючы на яго, мусіць, ніякай надзеі. І праўда ж, конь тады дадыхаў, і не было веры, што ён яшчэ ўстане на ногі. Колькі з ім папаваждаліся, каб падняць зноў. Ён устаў, але як няпэўна ходзяць па зямлі слабыя яго ногі. А што ж з яго карысці, з такога каня, які не мае сілы!

Калі б быў у Васіля хоць такі канёк, як у Чарнушкі. Таксама не Бог ведае што, не раўня таму, якога прывёў стары Корч з мазырскага кірмашу зімою, а ўсё-такі конь як конь. Аснова.

Дарога пачала паніжацца, і сыпкі пясок яе змяніўся мяккім, падатным забалочаным грунтам, на якім вырэзваліся дзве чорныя вільготныя каляіны. У каляінах часта віднеліся вылузганыя жылы карнявішчаў, было многа ям, і калёсы амаль увесь час падскоквалі, моцна хісталіся з боку на бок. Камлі дрэваў часам сунуліся паўз самыя драбінкі, і маці перасцярожліва схавала ногі ў воз. Васіль жа сядзеў па-ранейшаму, час ад часу, нібы ў гульні, перакідваючы ногі цераз драбіны.

Турботы было не толькі нагам, але і рукам: вакол хмарамі звінелі, апаноўвалі асатанелыя камары, амаль безупынна даводзілася адмахвацца ад іх, біць. Маці закрыла хусткай ледзь не ўвесь твар, падкурчыла ногі, але ратунку і так не было. Камарэча даставала цераз вопратку, залазіла ў рукавы, за каўнер.

Гуз адбіваўся-адбіваўся хвастом, галавой, не вытрымаў, патрухаў уподбег. Але гэта не памагло, і ён зноў пайшоў, круціў хвастом, матляў грывай, стрыг вушамі...

Лес тут быў зусім іншы, як на пясчаніку. Рослыя, з чорнымі, быццам абпаленымі, камлямі, з дзіўна паточанай карой, старыя алешыны танулі знізу ў густым балотным разнатраўі, у маладой пораслі алешын, у гнілым, асклізлым ламаччы. Алешнік вельмі часта мяшаўся з лазняком, што рос моцнымі дружнымі купамі, уздымаючы ў лясны прыцемак шызыя кучары пераплеценага галля.

У лесе буяла мноства злой, палючай лясной крапівы, што дзе-нідзе ўздымалася загонамі ў чалавечы рост. «Глядзі ты, колькі выперлася яе, етай поскудзі! - мімаволі праплыло ў галаве ў Васіля. - І якая - як каноплі!..»

З-за павароту ён зноў убачыў наперадзе Чарнушкавы калёсы, белую Ганніну хустачку, і думкі яго вярнуліся к дзяўчыне: «Я етаго табе не забуду! Пабачыш!»



2



Калі Васіль пад'ехаў да сенажаці, Чарнушка ўжо выводзіў з аглабель распрэжанага каня. Хведзька, прысеўшы наўколенцы, штосьці зацікаўлена разглядаў у траве, а Ганна перакладвала пад калёсы біклажку. Васіль знарок адвярнуўся, каб не глядзець у яе бок, але міма яго ўсё ж не прайшло ні тое, што яна рабіла, ні тое, як яна зірнула на яго. Зірнула з усмешачкай, і Васілю здалося, што з яе язычка зноў сарвецца штосьці кплівае, крыўднае.

Яна прамаўчала.

- Васіль, а мо тут станем? - прамовіла маці. - Разам з імі? Мясцінка, глядзі, якая...

Надзелы Чарнушкаў і Васілёвай маці былі побач. Васіль у іншы час так і зрабіў бы, як казала маці, - гэта было зручна і выгадна: спакайней было б і за коней, і за калёсы, за якімі назіралі б і Чарнушкі. Але сёння сын панура заўпарціўся:

- Мясцінка як мясцінка...

Ён суняў каня далей, крокаў праз трыццаць, ля куста маладога арэшніку. Азірнуўся, акінуў позіркам даволі вялікае, акружанае з усіх бакоў лесам балота. На балоце там і тут кучаравіліся кусты лазы, якія дзе-нідзе зрасталіся ў цэлыя астраўкі. Але Васіль не даў ніякай увагі гэтым астраўкам, яго больш зацікавіла, што на балоце яшчэ было многа вады, часам цэлыя разводдзі. Вада была і на яго надзеле. «Чорт бы яе пабраў!» - падумаў Васіль.

Пры ўзлесках амаль усюды стаялі калёсы, завіхаліся людзі. Нямала людзей было і на балоце - ужо дзе-нідзе касілі.

Стрыножыўшы Гуза, Васіль пусціў яго пасвіцца, вярнуўся к калёсам і выцягнуў касу. Ён развязаў анучку, абгорнутую вакол нажа касы, і, ускінуўшы касу на плячо, перапоўнены гонарам, стрымана, паважна падаўся да сенажаці.

Маці, маўклівая і паслухмяная, пайшла ўслед за ім.

- Тут. Нашае - адсюль і унь датуль, дзе калок, - сказала яна.

Яна магла б і не гаварыць гэтага, бо Васіль і сам ведаў свой надзел, - відаць, ёй проста было няёмка стаяць каля сына.

Васіль заўважыў на яе твары, у складцы родных губ выраз нейкага шкадавання і вінаватасці і строга прамовіў:

- Знаю.

Уваткнуўшы канец касся ў мяккую зямлю, трымаючы моцна рукой тупы край касы, Васіль стаў мянташыць. Адмахнуўшыся ад камароў, коса зірнуўшы на Чарнушкаў, убачыў, што Цімох яшчэ корпаецца каля воза, і задаволена падумаў, што пачынае раней.

Расставіўшы па-мужчынску ногі, моцна ўпінаючыся ў грунт, ён размашыста правёў касой, і трава шыркнула, паслухмяна лягла злева акуратнай купкай. Ён правёў другі раз, трэці, трава злева стала выцягвацца ў вільготны зялёны рад. Хутка ногі яго ступілі на пакошу, перад ім быў ужо лапік чыстага, скошанага ім. Хто гэта казаў, што ён яшчэ зялёны касіць? Што яму, быццам, кашы яшчэ многа трэба! Кашы, можа, каму-небудзь і трэба, толькі - каму іншаму. Але не яму, не Васілю. Праўду кажуць, што касіць - справа не абы-якая, мужчынская справа, тут трэба і сіла, і спрыт, умець трэба. Але ў Васіля ўсё гэта ёсць. Глядзіце, як ладна шыркае ў яго каса, як кладзецца, даўжэе рад!

«Ш-шырк, ш-шырк», - згодна прамаўляла ў лад Васілёвым думкам каса.

Ён адчуваў, што ззаду стаіць маці, пазірае ўслед, ласкавая і гордая, і ад гэтага ў руках і нагах сілы быццам большала. Разам з маці, акрамя яе, ён адчуваў за спіной яшчэ адну істоту, зусім іншую, чым маці, кплівую і нядобрую, якая, можа быць, таксама сочыць за ім сваім падсцярожлівым позіркам. Што ж, няхай сочыць, яму гэта ніяк не абыходзіць!

Васіль заўважыў, што дзядзька Цімох таксама пачаў павольна, мерна махаць касою. Ён ідзе паціху, крыху горбячыся. Васіль таксама крыху прыгорбіўся - так ходзяць усе сталыя людзі. Убачыўшы, як дзядзька ідзе, успомніў, што галоўнае пры касьбе - не спяшацца, не высільвацца, каб не змарыцца да пары.

Задумаўся, не асцярогся, і каса знянацку з усяго маху ўрэзалася ў нешта цвёрдае. Купіна, каб яна правалілася! Васіль хутчэй выцягнуў касу і коса зірнуў да Чарнушкаў - ці не заўважылі.

- Што там, Вась? - адгукнулася маці.

- Нічога.

Ён сказаў рэзка, нездаволена, спагнаў на ёй прыкрасць. Няхай не крыўдзіцца, няма чаго стаяць ды глядзець, калі чалавек заняты!

Маці нібы здагадалася пра яго думкі.

- Я пайду к каню... Памагай табе Бог!

Яна перахрысціла яго, блаславіла і, уздыхнуўшы, пайшла к калёсам. Васіль, не нагінаючыся, каб не паказаць, быццам нешта здарылася, агледзеў касу і супакоіўся. Каса была цэлая. Ён зноў правёў па траве, каса ішла добра, як і раней. Касіў ён цяпер асцярожней, сачыў за куп'ем, якое пачынала трапляцца ўсё часцей і часцей.

Трава была тут небагатая, найбольш асака. «Эх, удзялілі дзяляначку, растуды іх...» - падумаў ён і ўспомніў, як крыўдавала маці, вярнуўшыся дамоў пасля падзелу. «Ведамо, адна, без чалавека. Няма каму пастаяць... Нічога, ето апошні раз. Цяпер я вазьмуся, няхай паспрабуюць зрабіць яшчэ так!.. Праўда, у Чарнушкі таксамо надзел не лепшы. Што ж, ён сам вінаваты! Ціхі занадто. Яму хоць палец у рот пакладзі!.. Няхай сам абабіваецца, калі такая ўрода!..» А Васіль не дасць, каб клалі палец у рот! Не папусціцца!..

Нагам стала мокра. Спачатку вада толькі чулася, дзе пасталы ўціскалі пакошу, потым стала хлюпаць між куп'я. Неўзабаве Васіль ужо ўвайшоў у ваду, якая абступіла, нібы нанова абгарнула ногі. Анучы ўраз прамоклі, калошыны знізу таксама сталі мокрыя, і ногі зрабіліся важчэйшыя, быццам самі набраклі вадою. Ад намоклай тканіны ногі першы час, пакуль не прывык крыху, непрыемна казытала. Але Васіль амаль не звярнуў на ўсё гэта ўвагі - хадзіць па балоце даводзілася ўжо нямала, і ў пасталах і без пасталоў, і ўсе такія дробныя прыкрасці здаваліся звычайнымі. Горш было тое, што скошаны рад цяпер лажыўся ў ваду. Трэба будзе зграбаць у вадзе, несці на сухое і раскідваць там, каб прасохла. Столькі лішняга клопату.

Вось што добра - вада цёплая. Не студзіць ног, не гоніць дрыжыкаў па целе, як у іншыя дні ўвосень або зімою, калі ад халодных мокрых ануч аж дух займае. Цёплая вада, і - дзякуй Богу. Ідзі, хлюпай пасталамі, вядзі касой мерна, роўна, справа - налева, справа - налева. Праўда, трохі цяжэй стала ісці - касу трэба амаль увесь час трымаць навісу, многа вады. Касіць тут не тое, што на сухім месцы. Запытай любога куранёўца, і ён табе скажа, што Мокуць - чортава месца, гіблае для касца.

«А чаго яе, етую сенажаць, так завуць? Мокуць... - падумалася Васілю. - Хіба ж толькі таму, што недалёко сяло, якое называецца Мокуць? Пэўна, кеб сухо тут було, то на сяло не паглядзелі б, далі б лугу мянушку не такую. А так от - «мокуць» і «мокуць», мокрае, гіблае месца...»

Часам каса чапляла ваду, уздымала, раскідвала пырскі - яны разляталіся, весела паблісквалі на сонцы. У вадзе каса шыркала інакш, як без вады, гушчэй, важчэй, працяжней.

Усё мацней угравала. Пот мачыў цвёрдыя, двух колераў валасы, поўз на лоб, абпалены сонцам, засцілаў вочы, цёк на кволыя, яшчэ амаль дзіцячыя грудзі, прыклейваў да спіны ўшчэнт змакрэлую сарочку.

Каса станавілася ўсё цяжэйшая. Рукі наліваліся ўтомаю, балелі ў локцях і плячах, слабелі, нагам было млосна. Млосць расплывалася і па ўсім целе. Хацелася сесці. З цягам часу жаданне гэтае не толькі не адыходзіла, а ўсё мацнела. Сесці, хоць на купіну, хоць у ваду. Пасядзець трохі, адпачыць, а там можна зноў устаць, зноў ісці.

Але Васіль не сеў. Ён трываў. Гэта было ўжо не ў навіну - цярпець, адольваць стому, адганяць прываблівую спакусу пагуляць, паленавацца. Зялёны гэты хлопец ужо з найпершага маленства адчуў, што жыццё - не вясёлае, бесклапотнае свята, а найбольш доўгі і клопатны будзень, што трэба цярпець. З усіх мудрасцей жыцця ён, як адну з найпершых, уведаў - трывай, цярпі! Усім цяжка бывае, усе церпяць, цярпі і ты!

Гэтаму яго вучыла маці, вучыў небагаты і немалы горкі вопыт. І ён цярпеў. Аблізваў салёны пот з губ, выціраў валасы, выцягнуў ніз сарочкі са штаноў, каб ветрык мог дайсці, астудзіць. І ўсё ж якая цяжкая была цяпер каса, як цяжка было адганяць млосць і слабасць у руках і ў нагах! І як хацелася сесці! Проста дзіва!

Ужо ні пра што не думалася, ні пра тое, дзе цяпер дзядзька Цімох, перагнаў ці не, нават пра тое, што вось ён, Васіль, не зялёны, а сталы чалавек, гаспадар...

Толькі калі знямогся зусім, калі дрыготкія, бяссільныя рукі апусцілі страшэнна важкую касу і не маглі ўжо скрануць, уваткнуў кассё ў купіну, падаўся да калёс. Ішоў важка, павольна, цягнучы ногі, што хлюпалі ў цёплай вадзе. З выгляду гэта быў падлетак, худы, даўгарукі, з тонкай шыяй, а па хадзе, па прыгорбленай постаці - мужчына.

Васіль ішоў нібы напіцца. Маці, завязаўшы хустку па-дзявочы, як касынку, - камары ўжо не назалялі, горача, - зграбала траву, абярэмкамі на граблях зносіла на сухое. З травы цякла вада, і маці старалася трымаць абярэмак і граблі перад сабою. На сухой пакошы ўжо было крыху разасланай травы.

Кінуўшы траву, яна зірнула на яго, і Васіль заўважыў, як на твары яе з'явілася шкадаванне. Хмурная, страсянула мокрую спадніцу.

- Перадыхні!.. Паляжы вунь там, у цяньку... Управімся, нідзе не дзенецца... трава етая.

Калі ён паваліўся ў траву каля воза, нахілілася, пяшчотна пагладзіла па галаве.



3



Пад вечар стары Чарнушка і Васілёва маці сабраліся ў сяло. Маці трэба было ехаць, каб накарміць Валодзьку, падаіць карову, дагледзець гаспадарку. У Чарнушкі ж дома была хворая жонка.

Хведзька і Ганна засталіся начаваць на лузе. Заставаліся тут і біклажка, і каса, і латаная світа - нашто ж вазіць туды-сюды без прычыны!

- Трымайся каля Васіля, - наказаў Чарнушка дачцэ, сеўшы на калёсы. - І ты, Васіль, глядзі за імі. Дзеўка, яна - дзеўка. І малое...

Маці, здаволеная тым, што Чарнушка ўзяўся падвезці, ахвотна падтрымала:

- Жывіце дружненько!

Васіль прамаўчаў. Але калі калёсы схаваліся ў лесе, ён адчуў, што нічога горшага, як застацца аднаму з Ганнаю тут, нельга было б і прыдумаць. Лепш бы і ён паехаў дамоў, чым вярэдзіцца тут з ёю!

Васіль знарок паказваў, што быць з ёю - яму як кара. Ганна сціпла маўчала, але яму бачылася, што яна таксама не рада такому таварыству. Стаяць, маўчаць з ёю было, як ні з кім, няёмка. Васіль не вытрываў: паказваючы, што ў яго поўна галава клопатаў, раптам рынуўся да Гуза, які стаяў каля арэшніку.

Хлопец звадзіў каня да азярца, амаль ушчэнт зарослага асакою, напаіў. Да азярца было з вярсту, і пакуль вярнуўся - на балота леглі першыя поцемкі. Павеяла сырасцю, стала халаднавата. Наводдалек у лазе пачаў збірацца туман.

«Жывіце дружненько!» - успомніў Васіль матчыны словы, убачыўшы Ганну, якая штосьці гаварыла брату. «Дружненько - і скажа ж, ей-богу!..» Ён падумаў, што будзе трымацца свайго воза і туды, да Чарнушкаў, больш не пойдзе.

Але прыбег Хведзька.

- Дзядзечко, хадзем к нам!

- Чаго ето? - Васіль няветліва адвярнуўся.

- Агеньчык раскладзем!

Васіль пастаяў, зрабіў выгляд, што заняты, - развязаў торбачку, стаў перабіраць у ёй, нібы чагосьці шукаў. Думаў, што малы не стане чакаць, але той не адыходзіў, сачыў за кожным яго рухам.

Што з ім зробіш! Васіль сярдзіта пажаваў скарынку, завязаў торбачку. Накінуў на плечы світку.

- У нас е запалка, - радасна паведаміў Хведзька, забягаючы наперад Васіля.

Ганна ўжо раскладвала агонь сама. Кволы агеньчык, перад якім яна ляжала наўколенцах, ледзь-ледзь жыў. Ён быў такі немачны, што не мог запаліць нават жмуток сухога сена, які трымала на ім дзяўчына. Амаль прыпаўшы тварам да агеньчыка, нібы ў паклоне, старалася вярнуць Ганна яму жыццё, дзьмухала, падтрымлівала, а ён тлеў усё слабей. Дзяўчына была ў адчаі.

- Дай я!

Васіль стаў наўколенцы поруч з ёю. Яна крыху адсунулася, але не адышла. Так яны некалькі хвілін і ляжалі, плячо каля пляча, намагаючыся ажывіць агеньчык, што канаў. Шчаку Васіля казытала пасма яе валасоў, незвычайна блізкая, але ён не адхіляўся. У яго быў адзін клопат, адзін непакой.

Агеньчык патух. Ганна ўстала, уздыхнула. Стала чуваць, як гудуць камары.

- Нічога. Я пайду пазычу вугольчык... - прамовіў суцешліва Васіль.

Вакол у розных месцах свяцілася ў цемры некалькі агнёў. Ён выбраў самы блізкі і хутка нацянькі пакрочыў на вясёлы гэты бляск. Каля агню ўкруг сядзелі стары Глушак Халімон, празваны па-вулічнаму Карчом, - сухенькі, няголены, - фарсісты Карчоў сын Яўхім і іх парабак, малады рабаваты хлопец з-за Прыпяці.

Вячэралі.

Васіль павітаўся.

- Што скажаш, чалавеча? - лагодна, сціпла сказаў стары.

- Вугольчык пазычце...

Яўхім устаў, плюнуў на далоні, прыгладзіў чуб. Фарсун, ён і тут ужо быў у крамным пінжаку, у ботах.

- Свой трэба мець!

- А вам шкода?

- Шкода не шкода, а трэба мець! Цяпер жа ўласць усё для такіх стараецца!..

- Яўхім! - адгукнуўся строга, нават грозна, бацька, папярхнуўшыся куляшом. Стары Глушак лагодна зірнуў на Васіля. - Бяры, чалавеча!.. Ён смяецца...

- Не, я - сур'ёзно. Аб етым унь напісано ў «Беднаце»...

- Яўхім! - павысіў голас стары Корч. Пасля паўзы ён запытаўся строга: - Ты куды?

- Да Аўдолі-салдаткі. Ці то - чырвонаармейкі?

Парабак засмяяўся.

- Як ты кажаш бацьку! - пачырванеў Глушак.

- Ну, куды? - Яўхім павёў плячамі. - Ну, пайду, пашукаю весялейшай кумпаніі!..

- Глядзі, недалёко. Штоб на бандзітаў не нарвацца! Чуў я, у Мокуці ўчора булі...

- Не нарвуся!

Нёс вугольчык Васіль голымі рукамі - перакідваў з далоні ў далонь, нібы гуляў. Чырвонае вочка весела бегала ў цемры.

Часам прыпыняўся і дзьмуў на агеньчык, каб не гас. Калі прыбег да Чарнушкаў, там адразу зрабілася клопатна. Ганна хутчэй падала жмуток сухога сена, схілілася разам. І зноў яе пасма казытала яго шчаку, але цяпер гэта не толькі не замінала, а было нават дзіўна прыемна яму. Яны разам дзьмулі на вугаль, на сена, і гэта таксама было прыемна.

Яшчэ больш прыемна стала, калі вугаль падпаліў сена і ўскінуўся жвавы агеньчык. Хведзька, які бегаў каля іх, хутчэй паспрабаваў сунуць галіну.

- Куды ты такую! Дурны, і дурны ж ты! - Ганна адпіхнула галіну і чамусьці засмяялася.



4



Нічога асаблівага не было ў гэты вечар, але памяць пра яго грэла і трывожыла іх потым многія гады.

Ганна памыла ў блізкай ямцы бульбу, насыпала ў кацялок і хацела паставіць яго пры агні, але Васіль перабіў:

- Давай я ралцы зраблю!

Ён, стараючыся не траціць паважнасці, па-мужчынску стала пакапаўся ў ламаччы, што было каля вогнішча, выбраў дзве дубовыя голькі, выразаў з іх ралцы і ўткнуў у зямлю. Зрабіўшы перакладзінку, паспрабаваўшы яе моц у руках, узяў у Ганны кацялок і павесіў над агнём.

- Так лепей, - прамовіў Васіль пад канец.

Ганна прамаўчала, але ў яе маўчанні ён пачуў згоду. Для Васіля гэта было ўцехай. Яны сядзелі адно супраць аднаго, глядзелі на ваду, што пачынала кружыцца, зацягвацца белай малочнай плеўкай, і хоць не гаварылі ні слова, дзіўна разумелі, чулі адно аднаго. Між іх жыла незвычайная лагода і добрая згоднасць. Не ўмаўляючыся, узялі яны кожны сабе абавязак і глядзелі яго: Ганна здымала накіп з вады, сачыла за кацялком, Васіль падкладваў ламачча, каб вогнішча не спадала. Пакуль варылася бульба, ён з Хведзькам некалькі разоў схадзіў у лес, падбавіў галля і толькі тады, калі запас быў зроблены добры, зноў сеў перад агнём.

Калі Ганна, зліваючы ваду, папрасіла яго вячэраць, Васіль, ад звычкі, якой трымаліся амаль усе ў Куранях, ад прыроджанай схільнасці да адзіноты, усё ж хацеў быў адмовіцца.

- Я пад'еў ужэ.

- Калі ты там еў! - як гаспадыня, запярэчыла яна. - Садзіся. Нядобра без гарачаго!..

Васіль паслухаўся, але без ахвоты. Ён прынёс ад свайго воза паўкаравая хлеба, брусок сала і жменю зялёнай цыбулі, паклаў перад Ганнай на хустку.

Вячэралі маўклівыя, насцярожаныя, нязвыклыя да такой, нібы сямейнай, блізкасці. Абдзіраючы ліпкую шкурку з бульбін, Васіль хмурыў лоб і ўсім сваім выглядам паказваў, што ён зусім не бянтэжыцца, што яму ведама, як належыць у такім разе трымацца мужчыну, але вачэй на Ганну не падымаў і ў думках злаваў на свае асабліва непаслухмяныя пальцы.

Толькі адзін Хведзька, мусіць, не зважаў ні на што: душачыся гарачай бульбай, прыкусваючы салам ды цыбуляю, выбіраў з кацялка бульбіну за бульбінай. Ён першы адступіўся ад кацялка.

Услед за ім выцер рукі аб штаны і Васіль.

- Шчэ еш, - сказала Ганна. - Ты ж не пад'еў.

- Не, хопіць...

- Нясмачная, можа, картопля?..

- Картопля як картопля...

Ён сапраўды не заўважыў, смачная ці нясмачная была гэтая бульба. Не да таго было. Ён нават быў рады, што гэта дзіўная, цяжкая вячэра скончылася. Падумаў, што сказаў, напэўна, нядобра, што трэба было б пахваліць бульбу. Але хваліць бульбу - гэта значыла хваліць і Ганну, а ён ніколі ў жыцці нікога не хваліў, тым больш дзяўчат. Гэтага ніхто з мужчын не рабіў.

Як мог стрымана, паважна, як і належыць мужчыну, Васіль падзякаваў.

- Няма за што, - адказала Ганна.

Васіль устаў, паглядзеў на сіняватае, глыбокае, зорамі вышытае неба.

- Пагода павінна буць!..

Ён хацеў быў ужо ісці да свайго воза, але Хведзька папрасіў:

- Дзядзечко, вы з намі застаньцеся!

Васіль нерашуча стаў. Ганна брала хустку, маўчала. Васіль кінуў на яе насцярожаны позірк.

- За Гузам глядзець трэба...

Ганна адгукнулася:

- Яго і адсюль відаць...

- Адсюль не так.

Ён намерыўся ісці, але Ганна, зразумеўшы гэта, ускінула на яго вочы, ціха, спалохана прызналася:

- Мне страшно...

- Чаго ето?..

- Бандзіты раптам аб'явяцца...

Яе шчырае слова, просьба ўразілі яго, адразу размякчылі ганарыстае мужчынскае сэрца. Такой просьбе ён не мог адмовіць. Сказаў, што застанецца. Прайшоў толькі да каня, паглядзеў, як трымаюцца путы, забраў з воза світку і зноў вярнуўся да вогнішча.

- Васіль, - сказала раптам Ганна дзіўна, нясмела і вінавата, - ты, мабуць, сердзішся... што я пасмяялася... Пра вочы і пра валасы - розныя...

Васіль нахмурыўся, прамаўчаў.

- Ты не сердзіся. - Яна пашкадавала. - Як што за язык цягне мяне - каб цябе зачапіць! Але ты не сердзіся! Я - не ад зла на цябе...

Неяк не хацелася верыць таму, што чуў. Усё чакаў, што выкіне што-небудзь зноў. Але не, не зарагатала. Пад канец дык проста збянтэжыла Васіля, аж пачырванеў.

- А што вочы такія ў цябе - дак мне ето, папраўдзе, даспадобы! Такіх ні ў кога няма болей. І сам ты - харошы, толькі што маўклівы, унурысты. Усё адно як грэбуеш дзеўкамі ці баішся!

- Е чаго пагарджаць ці баяцца.

- Ну, а так здаецца!..

Памаўчалі. Ганна стала ладзіць Хведзьку і сабе пасцелю. Хутка яна, абняўшы адной рукой брата, другой адбіваючыся ад камарэчы, ляжала каля вогнішча, а Васіль яшчэ сядзеў, праз меру ўважліва пазіраў на агонь. Было вельмі радасна ад таго, што яна сказала пра кпіны свае і пра яго вочы. І ўжо як і не было злосці на яе. Была толькі радасць і турбота, якая мяшалася з гэтай радасцю і з якой невядома што было рабіць. Усё-такі класціся тут, каля Ганны, хоць яна і прасіла, было не проста, няёмка.

- Дзядзечко, а вы чаго седзіце? - не ўтрываў нарэшце Хведзька.

- Не хочацца нешто спаць...

- А ты ляж, паспрабуй... Заснеш, можа... - параіла Ганна.

Васіль стаў ладаваць світу на другі бок вогнішча, але Хведзька - вось жа зараза! - папрасіў:

- Сюды ідзіце, бліжай!

Васіль, каб не падумалі чаго-небудзь непатрэбнага - што ён баіцца Ганны, напрыклад, - перанёс світу бліжэй.

Доўга не спалася Васілю ў гэту ноч, такую звычайную і незвычайную. Укрыўшыся з галавою ад камароў, ён толькі прыкідваўся, што спіць, але сон не ішоў да яго. Расплюшчваючы вочы, бачыў Васіль з-пад світы, як ападаў, гас агонь, як сівелі вугольчыкі, бачыў у парадзелай цемры воз і каня непадалёк, які час ад часу пырхаў, бачыў, як пануе далей белым возерам туман. І ўсё, што ён бачыў, было дзіўна сагрэта Ганнінай блізкасцю, яе стомленым дыханнем, якое ён слухаў, нечым цёплым, невыказным, незразумелым, што паявілася ў гэты вечар, што бянтэжыла яго і ад чаго аж млелі перапоўненыя радасным чаканнем грудзі.

Але змора нарэшце ўзяла сваё.

Абудзіўшыся ўранку ад штуршка, Васіль убачыў над сабою Яўхіма Карча, які, мусіць, вяртаўся з начной уцехі.

- А хітра прыладзіўся, Дзятлік! - падміргнуў Яўхім. - Такі нібы варона, а як да дзеўкі - не промах!

Васіль спасцярожліва азірнуўся на Ганну - яна ўжо не спала, усё чула, - і губы яго задрыжалі ад гневу.

- Адыдзі ты!..

Яўхім дабрадушна ўсміхнуўся.

- Не бойся, не адаб'ю. Такога цвету - па ўсяму свету!

Ганна едка адгукнулася:

- Чаго не ясі, таго ў рот не нясі! Шчасце якое! Патрэбен ты мне, як хата сабаку!

- Патрэбен не патрэбен, а, мабуць, не адмовіла б!

- Малы жук, ды - вялікі гук!

Яна сказала гэта з такой абразлівай насмешкай, што Яўхім адразу не знайшоў, што і сказаць. Не зважаючы на яго, Ганна папрасіла Васіля ласкава:

- Я хутка паснедаць чаго зраблю. Прыходзь. Добра?

- Добра...

- Ну, язык Бог даў!

Яўхім плюнуў, павёў плячом і ляніва пацягнуўся да свайго табара.

EOT;

    /*
    *** START: FULL LICENSE ***

    Creative Commons Legal Code

    Attribution-ShareAlike 3.0 Unported


    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE
    LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN
    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS
    INFORMATION ON AN "AS-IS" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES
    REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR
    DAMAGES RESULTING FROM ITS USE. License

    THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS
    CREATIVE COMMONS PUBLIC LICENSE ("CCPL" OR "LICENSE"). THE WORK IS
    PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE
    WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS
    PROHIBITED.

    BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND
    AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS
    LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU
    THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH
    TERMS AND CONDITIONS.

    1. Definitions

    "Adaptation" means a work based upon the Work, or upon the Work and
    other pre-existing works, such as a translation, adaptation,
    derivative work, arrangement of music or other alterations of a
    literary or artistic work, or phonogram or performance and includes
    cinematographic adaptations or any other form in which the Work may be
    recast, transformed, or adapted including in any form recognizably
    derived from the original, except that a work that constitutes a
    Collection will not be considered an Adaptation for the purpose of
    this License. For the avoidance of doubt, where the Work is a musical
    work, performance or phonogram, the synchronization of the Work in
    timed-relation with a moving image ("synching") will be considered an
    Adaptation for the purpose of this License. "Collection" means a
    collection of literary or artistic works, such as encyclopedias and
    anthologies, or performances, phonograms or broadcasts, or other works
    or subject matter other than works listed in Section 1(f) below,
    which, by reason of the selection and arrangement of their contents,
    constitute intellectual creations, in which the Work is included in
    its entirety in unmodified form along with one or more other
    contributions, each constituting separate and independent works in
    themselves, which together are assembled into a collective whole. A
    work that constitutes a Collection will not be considered an
    Adaptation (as defined below) for the purposes of this License.
    "Creative Commons Compatible License" means a license that is listed
    at http://creativecommons.org/compatiblelicenses that has been
    approved by Creative Commons as being essentially equivalent to this
    License, including, at a minimum, because that license: (i) contains
    terms that have the same purpose, meaning and effect as the License
    Elements of this License; and, (ii) explicitly permits the relicensing
    of adaptations of works made available under that license under this
    License or a Creative Commons jurisdiction license with the same
    License Elements as this License. "Distribute" means to make available
    to the public the original and copies of the Work or Adaptation, as
    appropriate, through sale or other transfer of ownership. "License
    Elements" means the following high-level license attributes as
    selected by Licensor and indicated in the title of this License:
    Attribution, ShareAlike. "Licensor" means the individual, individuals,
    entity or entities that offer(s) the Work under the terms of this
    License. "Original Author" means, in the case of a literary or
    artistic work, the individual, individuals, entity or entities who
    created the Work or if no individual or entity can be identified, the
    publisher; and in addition (i) in the case of a performance the
    actors, singers, musicians, dancers, and other persons who act, sing,
    deliver, declaim, play in, interpret or otherwise perform literary or
    artistic works or expressions of folklore; (ii) in the case of a
    phonogram the producer being the person or legal entity who first
    fixes the sounds of a performance or other sounds; and, (iii) in the
    case of broadcasts, the organization that transmits the broadcast.
    "Work" means the literary and/or artistic work offered under the terms
    of this License including without limitation any production in the
    literary, scientific and artistic domain, whatever may be the mode or
    form of its expression including digital form, such as a book,
    pamphlet and other writing; a lecture, address, sermon or other work
    of the same nature; a dramatic or dramatico-musical work; a
    choreographic work or entertainment in dumb show; a musical
    composition with or without words; a cinematographic work to which are
    assimilated works expressed by a process analogous to cinematography;
    a work of drawing, painting, architecture, sculpture, engraving or
    lithography; a photographic work to which are assimilated works
    expressed by a process analogous to photography; a work of applied
    art; an illustration, map, plan, sketch or three-dimensional work
    relative to geography, topography, architecture or science; a
    performance; a broadcast; a phonogram; a compilation of data to the
    extent it is protected as a copyrightable work; or a work performed by
    a variety or circus performer to the extent it is not otherwise
    considered a literary or artistic work. "You" means an individual or
    entity exercising rights under this License who has not previously
    violated the terms of this License with respect to the Work, or who
    has received express permission from the Licensor to exercise rights
    under this License despite a previous violation. "Publicly Perform"
    means to perform public recitations of the Work and to communicate to
    the public those public recitations, by any means or process,
    including by wire or wireless means or public digital performances; to
    make available to the public Works in such a way that members of the
    public may access these Works from a place and at a place individually
    chosen by them; to perform the Work to the public by any means or
    process and the communication to the public of the performances of the
    Work, including by public digital performance; to broadcast and
    rebroadcast the Work by any means including signs, sounds or images.
    "Reproduce" means to make copies of the Work by any means including
    without limitation by sound or visual recordings and the right of
    fixation and reproducing fixations of the Work, including storage of a
    protected performance or phonogram in digital form or other electronic
    medium. 2. Fair Dealing Rights. Nothing in this License is intended to
    reduce, limit, or restrict any uses free from copyright or rights
    arising from limitations or exceptions that are provided for in
    connection with the copyright protection under copyright law or other
    applicable laws.

    3. License Grant. Subject to the terms and conditions of this License,
    Licensor hereby grants You a worldwide, royalty-free, non-exclusive,
    perpetual (for the duration of the applicable copyright) license to
    exercise the rights in the Work as stated below:

    to Reproduce the Work, to incorporate the Work into one or more
    Collections, and to Reproduce the Work as incorporated in the
    Collections; to create and Reproduce Adaptations provided that any
    such Adaptation, including any translation in any medium, takes
    reasonable steps to clearly label, demarcate or otherwise identify
    that changes were made to the original Work. For example, a
    translation could be marked "The original work was translated from
    English to Spanish," or a modification could indicate "The original
    work has been modified."; to Distribute and Publicly Perform the Work
    including as incorporated in Collections; and, to Distribute and
    Publicly Perform Adaptations. For the avoidance of doubt:

    Non-waivable Compulsory License Schemes. In those jurisdictions in
    which the right to collect royalties through any statutory or
    compulsory licensing scheme cannot be waived, the Licensor reserves
    the exclusive right to collect such royalties for any exercise by You
    of the rights granted under this License; Waivable Compulsory License
    Schemes. In those jurisdictions in which the right to collect
    royalties through any statutory or compulsory licensing scheme can be
    waived, the Licensor waives the exclusive right to collect such
    royalties for any exercise by You of the rights granted under this
    License; and, Voluntary License Schemes. The Licensor waives the right
    to collect royalties, whether individually or, in the event that the
    Licensor is a member of a collecting society that administers
    voluntary licensing schemes, via that society, from any exercise by
    You of the rights granted under this License. The above rights may be
    exercised in all media and formats whether now known or hereafter
    devised. The above rights include the right to make such modifications
    as are technically necessary to exercise the rights in other media and
    formats. Subject to Section 8(f), all rights not expressly granted by
    Licensor are hereby reserved.

    4. Restrictions. The license granted in Section 3 above is expressly
    made subject to and limited by the following restrictions:

    You may Distribute or Publicly Perform the Work only under the terms
    of this License. You must include a copy of, or the Uniform Resource
    Identifier (URI) for, this License with every copy of the Work You
    Distribute or Publicly Perform. You may not offer or impose any terms
    on the Work that restrict the terms of this License or the ability of
    the recipient of the Work to exercise the rights granted to that
    recipient under the terms of the License. You may not sublicense the
    Work. You must keep intact all notices that refer to this License and
    to the disclaimer of warranties with every copy of the Work You
    Distribute or Publicly Perform. When You Distribute or Publicly
    Perform the Work, You may not impose any effective technological
    measures on the Work that restrict the ability of a recipient of the
    Work from You to exercise the rights granted to that recipient under
    the terms of the License. This Section 4(a) applies to the Work as
    incorporated in a Collection, but this does not require the Collection
    apart from the Work itself to be made subject to the terms of this
    License. If You create a Collection, upon notice from any Licensor You
    must, to the extent practicable, remove from the Collection any credit
    as required by Section 4(c), as requested. If You create an
    Adaptation, upon notice from any Licensor You must, to the extent
    practicable, remove from the Adaptation any credit as required by
    Section 4(c), as requested. You may Distribute or Publicly Perform an
    Adaptation only under the terms of: (i) this License; (ii) a later
    version of this License with the same License Elements as this
    License; (iii) a Creative Commons jurisdiction license (either this or
    a later license version) that contains the same License Elements as
    this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative
    Commons Compatible License. If you license the Adaptation under one of
    the licenses mentioned in (iv), you must comply with the terms of that
    license. If you license the Adaptation under the terms of any of the
    licenses mentioned in (i), (ii) or (iii) (the "Applicable License"),
    you must comply with the terms of the Applicable License generally and
    the following provisions: (I) You must include a copy of, or the URI
    for, the Applicable License with every copy of each Adaptation You
    Distribute or Publicly Perform; (II) You may not offer or impose any
    terms on the Adaptation that restrict the terms of the Applicable
    License or the ability of the recipient of the Adaptation to exercise
    the rights granted to that recipient under the terms of the Applicable
    License; (III) You must keep intact all notices that refer to the
    Applicable License and to the disclaimer of warranties with every copy
    of the Work as included in the Adaptation You Distribute or Publicly
    Perform; (IV) when You Distribute or Publicly Perform the Adaptation,
    You may not impose any effective technological measures on the
    Adaptation that restrict the ability of a recipient of the Adaptation
    from You to exercise the rights granted to that recipient under the
    terms of the Applicable License. This Section 4(b) applies to the
    Adaptation as incorporated in a Collection, but this does not require
    the Collection apart from the Adaptation itself to be made subject to
    the terms of the Applicable License. If You Distribute, or Publicly
    Perform the Work or any Adaptations or Collections, You must, unless a
    request has been made pursuant to Section 4(a), keep intact all
    copyright notices for the Work and provide, reasonable to the medium
    or means You are utilizing: (i) the name of the Original Author (or
    pseudonym, if applicable) if supplied, and/or if the Original Author
    and/or Licensor designate another party or parties (e.g., a sponsor
    institute, publishing entity, journal) for attribution ("Attribution
    Parties") in Licensor's copyright notice, terms of service or by other
    reasonable means, the name of such party or parties; (ii) the title of
    the Work if supplied; (iii) to the extent reasonably practicable, the
    URI, if any, that Licensor specifies to be associated with the Work,
    unless such URI does not refer to the copyright notice or licensing
    information for the Work; and (iv) , consistent with Ssection 3(b), in
    the case of an Adaptation, a credit identifying the use of the Work in
    the Adaptation (e.g., "French translation of the Work by Original
    Author," or "Screenplay based on original Work by Original Author").
    The credit required by this Section 4(c) may be implemented in any
    reasonable manner; provided, however, that in the case of a Adaptation
    or Collection, at a minimum such credit will appear, if a credit for
    all contributing authors of the Adaptation or Collection appears, then
    as part of these credits and in a manner at least as prominent as the
    credits for the other contributing authors. For the avoidance of
    doubt, You may only use the credit required by this Section for the
    purpose of attribution in the manner set out above and, by exercising
    Your rights under this License, You may not implicitly or explicitly
    assert or imply any connection with, sponsorship or endorsement by the
    Original Author, Licensor and/or Attribution Parties, as appropriate,
    of You or Your use of the Work, without the separate, express prior
    written permission of the Original Author, Licensor and/or Attribution
    Parties. Except as otherwise agreed in writing by the Licensor or as
    may be otherwise permitted by applicable law, if You Reproduce,
    Distribute or Publicly Perform the Work either by itself or as part of
    any Adaptations or Collections, You must not distort, mutilate, modify
    or take other derogatory action in relation to the Work which would be
    prejudicial to the Original Author's honor or reputation. Licensor
    agrees that in those jurisdictions (e.g. Japan), in which any exercise
    of the right granted in Section 3(b) of this License (the right to
    make Adaptations) would be deemed to be a distortion, mutilation,
    modification or other derogatory action prejudicial to the Original
    Author's honor and reputation, the Licensor will waive or not assert,
    as appropriate, this Section, to the fullest extent permitted by the
    applicable national law, to enable You to reasonably exercise Your
    right under Section 3(b) of this License (right to make Adaptations)
    but not otherwise. 5. Representations, Warranties and Disclaimer

    UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING,
    LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR
    WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED,
    STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF
    TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE,
    NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY,
    OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE.
    SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES,
    SO SUCH EXCLUSION MAY NOT APPLY TO YOU.

    6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY
    APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY
    LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR
    EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK,
    EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.

    7. Termination

    This License and the rights granted hereunder will terminate
    automatically upon any breach by You of the terms of this License.
    Individuals or entities who have received Adaptations or Collections
    from You under this License, however, will not have their licenses
    terminated provided such individuals or entities remain in full
    compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will
    survive any termination of this License. Subject to the above terms
    and conditions, the license granted here is perpetual (for the
    duration of the applicable copyright in the Work). Notwithstanding the
    above, Licensor reserves the right to release the Work under different
    license terms or to stop distributing the Work at any time; provided,
    however that any such election will not serve to withdraw this License
    (or any other license that has been, or is required to be, granted
    under the terms of this License), and this License will continue in
    full force and effect unless terminated as stated above. 8.
    Miscellaneous

    Each time You Distribute or Publicly Perform the Work or a Collection,
    the Licensor offers to the recipient a license to the Work on the same
    terms and conditions as the license granted to You under this License.
    Each time You Distribute or Publicly Perform an Adaptation, Licensor
    offers to the recipient a license to the original Work on the same
    terms and conditions as the license granted to You under this License.
    If any provision of this License is invalid or unenforceable under
    applicable law, it shall not affect the validity or enforceability of
    the remainder of the terms of this License, and without further action
    by the parties to this agreement, such provision shall be reformed to
    the minimum extent necessary to make such provision valid and
    enforceable. No term or provision of this License shall be deemed
    waived and no breach consented to unless such waiver or consent shall
    be in writing and signed by the party to be charged with such waiver
    or consent. This License constitutes the entire agreement between the
    parties with respect to the Work licensed here. There are no
    understandings, agreements or representations with respect to the Work
    not specified here. Licensor shall not be bound by any additional
    provisions that may appear in any communication from You. This License
    may not be modified without the mutual written agreement of the
    Licensor and You. The rights granted under, and the subject matter
    referenced, in this License were drafted utilizing the terminology of
    the Berne Convention for the Protection of Literary and Artistic Works
    (as amended on September 28, 1979), the Rome Convention of 1961, the
    WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms
    Treaty of 1996 and the Universal Copyright Convention (as revised on
    July 24, 1971). These rights and subject matter take effect in the
    relevant jurisdiction in which the License terms are sought to be
    enforced according to the corresponding provisions of the
    implementation of those treaty provisions in the applicable national
    law. If the standard suite of rights granted under applicable
    copyright law includes additional rights not granted under this
    License, such additional rights are deemed to be included in the
    License; this License is not intended to restrict the license of any
    rights under applicable law. Creative Commons Notice

    Creative Commons is not a party to this License, and makes no warranty
    whatsoever in connection with the Work. Creative Commons will not be
    liable to You or any party on any legal theory for any damages
    whatsoever, including without limitation any general, special,
    incidental or consequential damages arising in connection to this
    license. Notwithstanding the foregoing two (2) sentences, if Creative
    Commons has expressly identified itself as the Licensor hereunder, it
    shall have all rights and obligations of Licensor.

    Except for the limited purpose of indicating to the public that the
    Work is licensed under the CCPL, Creative Commons does not authorize
    the use by either party of the trademark "Creative Commons" or any
    related trademark or logo of Creative Commons without the prior
    written consent of Creative Commons. Any permitted use will be in
    compliance with Creative Commons' then-current trademark usage
    guidelines, as may be published on its website or otherwise made
    available upon request from time to time. For the avoidance of doubt,
    this trademark restriction does not form part of the License.

    Creative Commons may be contacted at http://creativecommons.org/.

    */
}
